Revit 2026 API

# EnergyDataSettingsGetFromDocument Method

---

Every project document has a EnergyDataSettings element. Family documents do not have EnergyDataSettings elements.

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static EnergyDataSettings GetFromDocument(
	Document cda
)
```
```vb
Public Shared Function GetFromDocument (
	cda As Document
) As EnergyDataSettings
```
```cpp
public:
static EnergyDataSettings^ GetFromDocument(
	Document^ cda
)
```
```fsharp
static member GetFromDocument :
        cda : Document -> EnergyDataSettings
```

#### Parameters

cda Document
     The document.

#### Return Value

EnergyDataSettings Returns the EnergyDataSettings element or NULL.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

EnergyDataSettings Class

Autodesk.Revit.DB.Analysis Namespace